<a href="https://colab.research.google.com/github/mokainzi/python/blob/main/assignment_module_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### In each cell complete the task using pandas

In [2]:
import pandas as pd
import numpy as np

Read in the titanic.csv file in the `~/data` directory as a pandas dataframe called **df**

Or you can also use this link: https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/titanic.csv

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/titanic.csv')

Display the head of the dataframe

In [4]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

What is the percentage of people who survived? (hint find the mean of the survival column)

In [ ]:
df[['Survived']].mean()

Survived    0.383838
dtype: float64

How many women and how many men survived?

In [ ]:
df.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.742038
male    0.188908

What is the percentage of people that survied who paid a fare less than 10?

In [10]:
len(df[(df['Fare'] < 10) & (df['Survived'] == 1)]) / len(df[df['Survived'] == 1])

0.195906432748538

What is the average age of those who didn't survive?

In [ ]:
df[df['Survived'] == 0].Age.mean()

30.62617924528302

What is the average age of those who did survive?

In [ ]:
df[df['Survived'] == 1].Age.mean()

28.343689655172415

What is the average age of those who did and didn't survive grouped by gender?

In [ ]:
df.groupby(['Sex', 'Survived']).Age.mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

## Tidy GDP

Manipulate the GDP.csv file and make it tidy, the result should be a pandas dataframe with the following columns:
* Country Name
* Country Code
* Year
* GDP

In [ ]:
# read GDP data, skipping empty/unrelated rows
data = pd.read_csv('https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/GDP.csv', skiprows=4)

In [ ]:
# take a look at the data
data.head()

  Country Name Country Code  ...          2017 Unnamed: 62
0        Aruba          ABW  ...           NaN         NaN
1  Afghanistan          AFG  ...  2.081530e+10         NaN
2       Angola          AGO  ...  1.242094e+11         NaN
3      Albania          ALB  ...  1.303935e+10         NaN
4      Andorra          AND  ...  3.012914e+09         NaN

[5 rows x 63 columns]

In [ ]:
# investigate potential unwanted feature/column: "Indicator Name" 
data['Indicator Name'].unique()

array(['GDP (current US$)'], dtype=object)

In [ ]:
# investigate potential unwanted feature/column: "Indicator Code" 
data['Indicator Code'].unique()

array(['NY.GDP.MKTP.CD'], dtype=object)

In [ ]:
# investigate potential unwanted feature/column: "Unnamed: 62" 
data['Unnamed: 62'].unique()

array([nan])

In [ ]:
# remove unwanted features/columns
data = data.drop(columns=['Indicator Name', 'Indicator Code', 'Unnamed: 62'])

In [ ]:
# reshape: years columns to Year and GDP columns
data = data.melt(id_vars=['Country Name', 'Country Code'], var_name='Year', value_name='GDP')

In [ ]:
# investigate missing values in the data
data.isnull().sum()

Country Name       0
Country Code       0
Year               0
GDP             3535
dtype: int64

In [ ]:
# proportion of missing values to data
data.isnull().sum() / len(data)

Country Name    0.000000
Country Code    0.000000
Year            0.000000
GDP             0.230865
dtype: float64

In [ ]:
# remove missing values from data
data = data.dropna()

In [ ]:
# our data is now tidy!
data

       Country Name Country Code  Year           GDP
1       Afghanistan          AFG  1960  5.377778e+08
11        Australia          AUS  1960  1.857319e+10
12          Austria          AUT  1960  6.592694e+09
14          Burundi          BDI  1960  1.960000e+08
15          Belgium          BEL  1960  1.165872e+10
...             ...          ...   ...           ...
15306         Samoa          WSM  2017  8.566265e+08
15307        Kosovo          XKX  2017  7.128691e+09
15309  South Africa          ZAF  2017  3.494193e+11
15310        Zambia          ZMB  2017  2.580867e+10
15311      Zimbabwe          ZWE  2017  1.784582e+10

[11777 rows x 4 columns]